@echo off
echo wahid-dl 音檔專用
echo ------------------------------------------------------------
set /p var=請輸入欲下載音檔之網址:
echo ------------------------------------------------------------
echo 下載開始
echo ------------------------------------------------------------
cd C:\wahid-dl
yt-dlp -c --throttled-rate 100K --extract-audio -f "bestaudio[ext=m4a]" %var%
echo ------------------------------------------------------------
echo 執行結束，請至資料夾內確認您的下載
echo ------------------------------------------------------------
pause